{
  "/posts/lang-terraform": {
    "title": "Terraform",
    "content": "\n\nThis is an introduction to Terraform\n\n![💡 resources/📂 files/lang-terraform.overview.png](lang-terraform/lang-terraform.overview.png)\n\n## Getting Started\n\nRead this to learn about [Strenghts of Terraform and Bicep](posts/lang-terraform-bicep)",
    "lastmodified": "2023-02-21T10:02:41.365200721Z",
    "tags": null
  },
  "/posts/lang-terraform-bicep": {
    "title": "Considering Terraform and Bicep",
    "content": "\n\nAs more organizations adopt cloud infrastructure, the demand for infrastructure as code (IAC) solutions has grown. Infrastructure as code allows developers to manage and automate infrastructure deployments using code, making it easier to track changes and maintain consistency.\n\nTerraform and Bicep are two popular IAC solutions that enable developers to manage and automate infrastructure deployments using code.\n\nWhile both tools share some similarities, Terraform is more widely adopted solution with many benefits,  In this post, we will highligh some of the benfits each expose, so you can start to figure out where you next learning should be focused\n\n## Bicep and ARM\n\nAzure Resource Manager (ARM) templates are a popular way to define and deploy infrastructure as code in Azure. However, writing ARM templates can be challenging, particularly for beginners. Bicep is a new language developed by Microsoft that makes writing Azure infrastructure code easier and more streamlined. In this blog post, we will explore the benefits of using Bicep over ARM.\n\n1. **Simpler Syntax**: Bicep's syntax is simpler and easier to read and write than ARM's. The code is written in JSON-like format and requires less boilerplate code. Additionally, Bicep has a smaller learning curve than ARM, making it easier for beginners to get started.\n    \n2. **Better Modularity**: Bicep's modular design allows developers to define reusable components and deploy them across multiple environments. This can help reduce code duplication and improve code maintainability. The modules in Bicep are simpler to define and use than the modules in ARM, which can make code reuse more accessible.\n    \n3. **Improved Type Safety**: Bicep provides type safety to help developers catch errors before deployment. The language's strong typing system ensures that variables are defined correctly and that the correct data types are used. This can help prevent errors in deployments and improve the overall quality of the code.\n    \n4. **Better Tooling**: Bicep has better tooling support than ARM. It is integrated with Visual Studio Code, which provides auto-completion and syntax highlighting for the language. Additionally, Bicep is integrated with Azure CLI, which makes it easier to manage and automate infrastructure deployments.\n    \n5. **Easier to Read and Maintain**: Bicep's simpler syntax and modular design make it easier to read and maintain compared to ARM. The code is less verbose and easier to understand, which can help reduce errors and improve code quality.\n    \n6. **Greater Consistency**: Bicep promotes consistency in infrastructure deployments. Developers can use templates across different environments, which can ensure that infrastructure is deployed consistently across all environments. This can help reduce errors and improve the overall quality of the infrastructure.\n    \nOf course, we can also ask the question, of what are the Benfits of ARM over Bicep. Azure Resource Manager (ARM) templates have been around for a while and are a widely adopted way to define and deploy infrastructure as code in Azure. While Bicep has many benefits, there are still some advantages to using ARM templates. \n\n1. **Widely Adopted**: ARM templates have been around for a while and are a widely adopted way to deploy infrastructure in Azure. Many organizations have already invested time and resources in building ARM templates, and they may find it easier to continue using them rather than switching to a new language.\n    \n2. **Better Compatibility**: ARM templates are compatible with more Azure services than Bicep. While Bicep is designed to work with Azure, ARM templates can be used with many other services and platforms, for example Azure Policy still requires ARM syntax.\n\n3. **Easier to Write for Experienced Developers**: Experienced developers *may* find it easier to write ARM templates than Bicep code. While Bicep is simpler and easier to learn for beginners, experienced developers may prefer the greater flexibility and complexity offered by ARM template\n\nIn conclusion, Bicep offers several benefits over ARM. Its simpler syntax, better modularity, improved type safety, better tooling, and easier-to-read code make it an attractive option for developers who are focused on Azure infrastructure. Additionally, its focus on consistency can help improve the overall quality of infrastructure deployments. While ARM templates remain a popular way to deploy Azure infrastructure, Bicep provides a more accessible and streamlined approach that can make infrastructure as code more accessible to developers of all skill levels.\n\n## Considerating Terraform\n\nBoth [Terraform](posts/lang-terraform)  and [bicep](bicep) use a declarative language, which means that it focuses on the desired end-state rather than the specific steps needed to achieve it. This makes it easier to manage and automate infrastructure changes.\n\nBoth options are very popular, and very powerful. At one point in time, Terraform was a poor option for working with Azure, and Bicep did not even exist (its just 2 years young). \n\nSelecting the Declarative Language and tooling is not black and white; so consider your requirements, and lets take a little time to conside their respective strengths.\n\n### Bicep Strengths\n\n1.  Simpler Syntax: Bicep has a simpler syntax than Terraform, making it easier for beginners to get started. The syntax is also more concise and readable, which can make code maintenance easier. The code is written in JSON-like format and requires less boilerplate code compared to Terraform's HashiCorp Configuration Language (HCL).\n    \n2.  Integrated Language: Bicep is built on top of the Azure Resource Manager (ARM) language and is fully integrated with Azure. This means that developers can use Bicep to write ARM templates that can be used with any Azure resource type. Additionally, Bicep has direct access to all Azure resources, including new features and services.\n    \n3.  Type Safety: Bicep provides type safety to help developers catch errors before deployment. The language's strong typing system ensures that variables are defined correctly and that the correct data types are used. This can help prevent errors in deployments and improve the overall quality of the code.\n    \n4.  Improved Modularity: Bicep's modular design allows developers to define reusable components and deploy them across multiple environments. This can help reduce code duplication and improve code maintainability. The modules in Bicep are simpler to define and use than the modules in Terraform, which can make code reuse more accessible.\n    \n5. Accessability: Bicep is included in the Azure Quickstart templates, which can make it easier to deploy infrastructure with a single click.\n\n### Terraform Strengths\n\n1.  Multi-cloud support: Terraform supports more cloud providers compared to Bicep. Terraform can be used to manage infrastructure across multiple cloud providers, including AWS, Azure, Google Cloud, and many others, while Bicep is currently only available for Azure.\n    \n2.  Greater ecosystem and community: Terraform has a larger and more active community compared to Bicep, making it easier to find resources, get help, and share knowledge.\n    \n3.  Modular design: Terraform's modular design allows for code reusability and easier management of large infrastructure deployments, while Bicep's module system is less robust and can be more challenging to maintain.\n    \n4.  Built-in state management: Terraform has built-in state management, which allows it to keep track of the current state of the infrastructure and make changes accordingly. Bicep relies on external state management - essentially the Azure Resource Manager.\n    \n5.  Richer documentation: Terraform has extensive documentation that covers every aspect of the tool, including configuration options, provider support, and best practices. Bicep's documentation is still developing and can be less comprehensive.\n    \n6.  More provider support: Terraform has a broader range of provider support compared to Bicep. This means that it can integrate with more services and resources from various cloud providers.\n    \n7.  Wider range of configuration options: Terraform provides more configuration options for its users, including custom providers, modules, and backend configurations, while Bicep's configuration options are more limited.\n    \n8.  More testing options: Terraform has more testing options compared to Bicep, such as testing infrastructure deployments with Terraform's built-in testing framework, Terratest.\n    \n9.  Greater maturity: Terraform has been around longer and has a more mature feature set, while Bicep is a relatively new tool and still in active development. Terraform has been battle-tested over the years and has a robust set of features.\n\n## Summary\n\nWhile Terraform is a popular IAC solution with many benefits, Bicep has some unique advantages that can make it the right choice for certain projects. Its simpler syntax, integrated language, type safety, improved modularity, and integration with other Azure tools make it an attractive option for developers who are focused on Azure-specific infrastructure. \n\nTerraform has several advantages over Bicep in terms of multi-cloud support, community, modular design, declarative language, state management, documentation, provider support, configuration options, testing options, and maturity. \n\nChoosing the right IAC tool for your organization is critical, and evaluating the features of each tool can help you make an informed decision. Ultimately, the choice between Terraform and Bicep will depend on the specific needs of your organization and the nature of your projects.",
    "lastmodified": "2023-02-21T10:02:41.36120053Z",
    "tags": null
  },
  "/posts/lang-terraform-quickstart": {
    "title": "Terraform Quick Start",
    "content": "\n\nIn the introduction to [Terraform](posts/lang-terraform) we got a general overview\n\n## Getting Started\n\nNow \n\n```bash\nterraform init\nterraform plan\nterraform apply\nterraform destroy\n```\n\n![WebHook](lang-terraform-quickstart/s.topdesk.webhook.png)\n\nsample notes",
    "lastmodified": "2023-02-21T10:02:41.365200721Z",
    "tags": null
  }
}