{
  "/posts/general_personal-reflection-2018": {
    "title": "Hitting Reset",
    "content": "\n\n10 Years, It is hard to believe that I have been posting thoughts here that long. And how so much has changed since I begun?\n\nI started this journey with the encouragement of some amazing people in Microsoft, as an opportunity to spread the news about *Hyper-V* and even more relevant at the time *System Center Virtual Machine Manager* which was still known by its code name!.\n\u003c!--more--\u003e\nMy daily experience with this application, Windows Server, and real-world enterprise issues; positioned me at one of the leading edges of Microsoft Technologies; and fully armed with a true business driver pushing forward. Wounds and pains exposed, I gained a lot of insight to the digital plumbing of these technologies and as a result of a lot of fantastic information to share - sometimes not good news; but never the less - reality.\n\nI have primarily worked in the mindset that when I find an issue to be addressed, before sharing, escalating or attacking - I need to stop and consider solutions; which normally result in a more constructive and progressive approach to unblocking my path. That ethos spans back to my days working as what would be considered today in 2018 as an *IoT* architect; but 20 years ago in a Rubber Molding plant, The Operations Manager always reminded me as I entered his office, \"If you don't have some suggestion for a solution before entering and presenting a problem, leave now, and come back when I am prepared (But don't spend all day - Problems cost money!).\"\n\nIn Hindsight, this approach challenged my limits every day; but I now also realise that he actually had no technical knowledge, and without my suggestions, we were heading the route of the Titanic!\n\n## System Center\n\nWhile the solution itself continues to live on, as clear from the very recent launch of *System Center 2019* at the Ignite Conference in Florida; My own passion and engagement with this technology has ultimately diminished to a point of history., despite co-authoring and technically reviewing a number of books, speaking at so many events, and investing 1000's of hours.\n\n## Personal Redevelopment\n\nAfter almost 20 years I changed Jobs, A decision which was extremely difficult to make; and honestly post that change point; I took at least 6 more months to adjust to the new world order.\n\nI found myself amidst a team of like-minded peers, left to find a niche which I could own. Despite working with fantastic scenarios, these new challenges were amazing; and I was learning new stuff again. But, yet I still felt uninspired.\n\nJust reflect on the number of blog posts I have published in the last 3 years.\n\nMy personal life also took a major change; and today after celebrating 21 years of marriage; I am a super proud father of two amazing girls, with my oldest just after celebrating her 4 birthday and the youngest just turned 2.\n\nWhen I reflect on these massive changes, it is a totally different world from when I stood just 10 years ago.\n\n## Inspiration\n\nLast week I participated in my first **Microsoft Ignite** event; and spent the vast majority of this opportunity meeting with so many old friends who have also evolved into completely new roles within their organizations.\n\nAs an example, Mr Taylor Brown; I had the honour of meeting Taylor for the first time almost 12 years ago. Back then we both were working on Test Scenarios for Hyper-V; in his role, he ran the labs for Microsoft's internal testing; and I was responsible for our internal *Technology Adoption Program (TAP)* Pilot testing. Today, Taylor owns the *Docker (Container)* features in Windows Server. An amazing achievement, from an inspiring person and a good friend. \n\nThere are so many amazing people, with just as amazing stories; and I was so proud to be able to stop, and say hello to these *icons*, and learn how their lives have also changed.\n\n## Governance\n\nAs the adoption, and practices of Cloud become centrally focused for so many organizations the focus shifts left, as Compliance, Control, and Culture changes ignite to enable a completely fresh view of the potential.\n\nWhen I combine past experience, with the foundational tooling which 3rd parties like Terraform offer, and native tooling which Microsoft adding to the core of their offerings, the next challenge is clear.\n\nNow, I see a clear path to assist organizations of any size to evolve from what might have been the chaos of Shadow IT, the central control of IT, or the old practices of Enterprise Architects; and guide them to a culture driven enablement of Cloud; supported with *Governance* and enabling that missing **trust** thought the use of *Safety Guard Rails*\n\n## Finding my Mojo\n\nLooking back at Ignite and the last 12 months of work; I now feel like I have a new rhythm. I have found a new passion - Namely that of enabling organizations on this transformation trough common sense, debate and technology.\n\nAddressing political issues, and provisioning the structures of support required to encourage trust and co-operation, all of which is based on logical technical foundations *(Yes Mr Spock!)*. \n\nEven more rewarding, I am actually observing directly the impact this has on people and processes as they evolve their life's with the culture changes required to start a new fabric of growth in cloud and DevOps practices; while also addressing their relationships with the business owners.\n\nI believe I have found my *Mojo*.\n\n## The Next Step...\n\nOver the last years, I have had the honour of presenting at so many fantastic conferences, delivering workshops, and engagement in meetups. When I reflect on the topics I have focused on these all have contributed to building strong foundational elements to this new way. \n\nTopics ranging from Containerization and Automation with Docker and Kubernetes, Serverless to AI, BOT Frameworks to Python, Git flow to Infrastructure as Code, DevOps to Event Handling; while all feel very disjointed, these technologies combined are core to understanding how the world is evolving, and therefore how the organizations can adopt.\n\nIts time to **Hit Refresh**, and join me on this next wave, as I share, present, document, and offer guidance; both here on the Blog, On stages in various locations and professionally, through a range of mediums from 'hands-on' demonstrations, Technical guides, papers, and talks.\n\nI have my *mojo* charged and ready; Have You?",
    "lastmodified": "2023-04-13T15:03:28.056341252Z",
    "tags": [
      "Career",
      "MVP",
      "Cisco Champion"
    ]
  },
  "/posts/iac_bicep_tags-as-parameters": {
    "title": "Bicep - Tags as Parameters",
    "content": "\nIn a post earlier, we look at using arm to lookup the value of tags' at both the Subscription and Resource Level.\n\nWith Bicep this is much easier to understand. This is the same lab configuration as in the original post, but this time to code should be a lot more readable.\n\n```powershell\n// Sample to lookup tag values \n// Both Subscription and Resource Level\n\n@description('The resource ID of the resource we wish to look up a tag from.')\nparam sourceResourceId string = '/subscriptions/547d54ea-411b-459e-b6f8-b3cc5e84c535/resourceGroups/p-vm/providers/Microsoft.Compute/virtualMachines/p-vm001'\n\n\n// Variables to reference the Tags Resource Providers\n\n// Subscription Tags Resource Provider\nvar referenceSubscriptionTagsResourceId = '/subscriptions/${subscription().subscriptionId}/providers/Microsoft.Resources/tags/default'\n\n// Resource Tags Resource Provider\nvar referenceResourceTagsResourceId = '${sourceResourceId}/providers/Microsoft.Resources/tags/default'\nvar referenceTagsApi = '2020-06-01'\n\n\n// \n// Lookup the tags and return the value\n// \n\n// Subscription Tags\noutput subscriptionRecoveryVaultRGTag string = reference(referenceSubscriptionTagsResourceId, referenceTagsApi).tags.recoveryVaultRG\noutput subscriptionRecoveryVaultTag string = reference(referenceSubscriptionTagsResourceId, referenceTagsApi).tags.recoveryVault\n\n// Resource Tags\noutput resourceRecoveryPolicyTag string = reference(referenceResourceTagsResourceId, referenceTagsApi).tags.recoveryPolicy\n\n\n// Concatanation of the outputs to build Resource Ids\n\noutput recoveryVaultId string = resourceId(subscription().subscriptionId, reference(referenceSubscriptionTagsResourceId, referenceTagsApi).tags.recoveryVaultRG, 'Microsoft.RecoveryServices/vaults', reference(referenceSubscriptionTagsResourceId, referenceTagsApi).tags.recoveryVault)\noutput recoveryPolicyId string = '${resourceId(subscription().subscriptionId, reference(referenceSubscriptionTagsResourceId, referenceTagsApi).tags.recoveryVaultRG, 'Microsoft.RecoveryServices/vaults', reference(referenceSubscriptionTagsResourceId, referenceTagsApi).tags.recoveryVault)}/backupPolicies/${reference(referenceResourceTagsResourceId, referenceTagsApi).tags.recoveryPolicy}'\n\n```",
    "lastmodified": "2023-04-13T15:03:28.05234129Z",
    "tags": [
      "ARM",
      "Azure",
      "Template",
      "Functions",
      "IaC"
    ]
  },
  "/posts/sw_active-directory_administrative-limits": {
    "title": "AD - Administrative Limits",
    "content": "\nI recently ran into an issue with a particular environment where Active Directory and PKI services were deployed. One of the service accounts which I was attempting to 'unlock' refused to co-operate and instead offered the most unhelpful message.\n \n**Administrative limit for this request was exceeded** - this was not my first time encountering the message, previously this haunted me while I was managing a Windows PKI infrastructure and with some quick searches, confirmed my initial suspicion. This is a symptom of an AD object quite simply being to large!\n \nActive Directory is in the simplest form a Database, and each object can be considered as a row in this database. Like any database there are limits to what data can be stored in the table, the type of data, but also the amount. \n \nUsing a tool like **ADSI Edit** will allow you to open the database, and select the schema partition we would like to work with. Standard objects which we can see in the *Active Directory Users and Computers* extension are all hosted in the partition called the *Default Naming Context*; which is where we need to focus for this problem\n\n![ADSI Edit - Default Naming Context](sw_active-directory_administrative-limits/sw_active-directory_administrative-limits_2021-07-27-10-55-18.png)\n\n## Identifying the Bloat\n\nThere is no super cool trick here, we just need a little investigation. Start by navigating the OU structure you are familiar with in Active Directory Users and Computers, to locate the account with issues.\n\n![AD Object Navigation in ADSI Edit](sw_active-directory_administrative-limits/sw_active-directory_administrative-limits_2021-07-27-11-00-37.png)\n\nRight Click on the object, and select **Properties** where you now get to view the 100's of columns of data which AD stores for each object. \n\nClick on the **Filter** button and enable the option *Show only attributes that have values* - this will remove all the columns which are empty - and therefore not adding to our overside object!\n\n![ADSI Properties Filter](sw_active-directory_administrative-limits/sw_active-directory_administrative-limits_2021-07-27-11-03-48.png)\n\nNow, you can check each of the remaining attributes (columns) and see what they contain, I'll save a few minutes, and in this case I expect my issue is to do with Certificates, so we will focus on the attribute called *userCertificate* which contains an collection of *[byte[]]*, each representing a Base64 encoded Certificate.\n\nBINGO! looking at this property I can see 100's of entries, and each one has the same *byte[]* string, which implies the same certificate is loaded into the object a lot of times.\n\nI am going to flush the lot of them out, as these are added by the system, and it will reload them as required; but for now, I am simply the garbage collector.\n\nUsing the UX, we can delete these 1 at a time, so we need a little automation, or the rest of the week will be wasted.\n\n## Powershell Helper\n\nUsing standard Active Directory module for Powershell, we can get a reference to the object which needs to be flushed\n\n```powershell\n$certUser = Get-Aduser \"svc_PKI_NDES\" -Properties certificates\n```\n\nNow, let's check what we got from AD\n\n```powershell\n$certuser.Certificates.Count\n1169\n```\n\nRight, time to fix this, we will use the following command to remove all the certificates from the object\n\n```powershell\nPS C:\\Users\\sysadmin.AD\u003e set-ADUser svc_PKI_NDES -Certificates @{}\n```\n\nAnd, let's confirm it worked\n```powershell\n$certuser = Get-ADUser svc_PKI_NDES -Properties Certificates\n$certuser.Certificates.count\n0\n```\n\nAnd now, just check that you can unlock the account, or complete the operation that sent you chasing this wild goose!",
    "lastmodified": "2023-04-13T15:03:28.05234129Z",
    "tags": [
      "AD"
    ]
  }
}